# CanSuppressSpaces Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..CanSuppressSpaces Method
FormatOptions Class See Also
---
Checks whether spaces can be suppressed for the display unit in this FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanSuppressSpaces()
```

Visual Basic
---
```text
Public Function CanSuppressSpaces As Boolean
```

Visual C++
---
```text
public:
bool CanSuppressSpaces()
```

# ### Return Value
True if spaces can be suppressed, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
CanSuppressSpaces Overload
Autodesk.Revit.DB Namespace